{
  "activation_freq": 10,
  "architectures": [
    "HyenaDNAForSequenceClassification"
  ],
  "auto_map": {
    "AutoConfig": "configuration_hyena.HyenaConfig",
    "AutoModel": "modeling_hyena.HyenaDNAModel",
    "AutoModelForCausalLM": "modeling_hyena.HyenaDNAForCausalLM",
    "AutoModelForSequenceClassification": "modeling_hyena.HyenaDNAForSequenceClassification"
  },
  "d_inner": 1024,
  "d_model": 256,
  "dtype": "float32",
  "emb_dim": 5,
  "embed_dropout": 0.1,
  "filter_order": 64,
  "hyena_dropout": 0.0,
  "hyena_filter_dropout": 0.0,
  "hyena_order": 2,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4",
    "5": "LABEL_5",
    "6": "LABEL_6",
    "7": "LABEL_7",
    "8": "LABEL_8",
    "9": "LABEL_9",
    "10": "LABEL_10",
    "11": "LABEL_11",
    "12": "LABEL_12",
    "13": "LABEL_13",
    "14": "LABEL_14",
    "15": "LABEL_15",
    "16": "LABEL_16"
  },
  "initializer_range": 0.02,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_10": 10,
    "LABEL_11": 11,
    "LABEL_12": 12,
    "LABEL_13": 13,
    "LABEL_14": 14,
    "LABEL_15": 15,
    "LABEL_16": 16,
    "LABEL_2": 2,
    "LABEL_3": 3,
    "LABEL_4": 4,
    "LABEL_5": 5,
    "LABEL_6": 6,
    "LABEL_7": 7,
    "LABEL_8": 8,
    "LABEL_9": 9
  },
  "layer_norm_epsilon": 1e-05,
  "max_seq_len": 32770,
  "model_type": "hyenadna",
  "n_layer": 4,
  "num_inner_mlps": 2,
  "pad_token_id": 4,
  "pad_vocab_size_multiple": 8,
  "problem_type": "single_label_classification",
  "short_filter_order": 3,
  "tie_word_embeddings": false,
  "train_freq": true,
  "transformers_version": "5.10.2",
  "use_bias": true,
  "vocab_size": 12
}
